product-scenarios/backend-service/ballerinaService/resources/xml/response/1_3_2_2_1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <ns:userDetails xmlns:ns="http://tempuri.org">
            <ns:userName>Shadow:):)</ns:userName>
            <ns:userId>1</ns:userId>
            <ns:age>32</ns:age>
            <ns:city>Colombo</ns:city>
        </ns:userDetails>
    </soapenv:Body>
</soapenv:Envelope>
